:PROPERTIES:
:ID:       53fc747a-3f12-411a-976a-345bb1924e2d
:END:
#+TITLE: VCS Version Control
#+AUTHOR:    David Conner
#+EMAIL:     noreply@te.xel.io
#+DESCRIPTION: notes

* Repo

** Docs

** Resources
+ Subcommands

** Issues
*** Management

**** List all projects tagged as $group

#+begin_src shell
repo list -g $group
#+end_src

**** Stash and unstash

#+begin_src shell
repo forall -c git stash
# ... run some commands like repo sync
repo forall -c git stash pop
#+end_src

**** Create Iterate Through A Group's Project's and Link

#+begin_src shell
cd /data/ecto/emacs
repo_link_groups emacs
#+end_src

#+RESULTS:
| BonfaceKilz_emacs              |
| BonfaceKilz/emacs              |
| Brettm12345_emacs              |
| Brettm12345/emacs              |
| abo-abo_emacs                  |
| abo-abo/emacs                  |
| bamos_dotfiles                 |
| bamos/dotfiles                 |
| bbatsov_emacs                  |
| bbatsov/emacs                  |
| benmezger_dotfiles             |
| benmezger/dotfiles             |
| cjbassi_dotfiles               |
| cjbassi/dotfiles               |
| daedreth_emacs                 |
| daedreth/emacs                 |
| daviwil_emacs                  |
| daviwil/emacs                  |
| dcunited001_doom               |
| dcunited001/doom               |
| dcunited001_dotfiles           |
| dcunited001/dotfiles           |
| dfeich_emacs-course            |
| dfeich/emacs-course            |
| dfeich_emacs-course-and-config |
| dfeich/emacs-course-and-config |
| dfeich_org-babel-examples      |
| dfeich/org-babel-examples      |
| frap_emacs                     |
| frap/emacs                     |
| gtrunsec_dotfiles              |
| gtrunsec/dotfiles              |
| joseph8th_emacs                |
| joseph8th/emacs                |
| karthink_emacs                 |
| karthink/emacs                 |
| kitnil_dotfiles                |
| kitnil/dotfiles                |
| kubemacs_emacs                 |
| kubemacs/emacs                 |
| lccambiaghi_emacs              |
| lccambiaghi/emacs              |
| magnars_emacs                  |
| magnars/emacs                  |
| mwfogleman_emacs               |
| mwfogleman/emacs               |
| purcell_emacs                  |
| purcell/emacs                  |
| rasendubi_emacs                |
| rasendubi/emacs                |
| sachac_emacs                   |
| sachac/emacs                   |
| tammymakesthings_emacs         |
| tammymakesthings/emacs         |
| tuhdo_emacs                    |
| tuhdo/emacs                    |
| ubolonton_emacs                |
| ubolonton/emacs                |
| zamansky_emacs                 |
| zamansky/emacs                 |


* Gerrit

+ [[https://github.com/orgs/GerritCodeReview][Github]] (clone)

** Docs

* Git

** Docs

** Resources

** Issues

* Fossil
